chtMultiregionFoam/multiRegionHeaterRadiation/constant/bottomAir/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/bottomAir/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


8
(
    minX
    {
        type            wall;
        nFaces          50;
        startFace       3858;
        inGroups        2 ( wall viewFactorWall );
    }

    maxX
    {
        type            wall;
        nFaces          50;
        startFace       3908;
        inGroups        2 ( wall viewFactorWall );
    }

    minY
    {
        type            wall;
        inGroups        2 ( wall viewFactorWall );
        nFaces          292;
        startFace       3958;
    }

    minZ
    {
        type            wall;
        inGroups        2 ( wall viewFactorWall );
        nFaces          150;
        startFace       4250;
    }

    maxZ
    {
        type            wall;
        inGroups        2 ( wall viewFactorWall );
        nFaces          150;
        startFace       4400;
    }

    bottomAir_to_rightSolid
    {
        type            mappedWall;
        inGroups        2 ( wall viewFactorWall );
        nFaces          130;
        startFace       4550;
        sampleMode      nearestPatchFace;
        sampleRegion    rightSolid;
        samplePatch     rightSolid_to_bottomAir;
    }

    bottomAir_to_leftSolid
    {
        type            mappedWall;
        inGroups        2 ( wall viewFactorWall );
        nFaces          130;
        startFace       4680;
        sampleMode      nearestPatchFace;
        sampleRegion    leftSolid;
        samplePatch     leftSolid_to_bottomAir;
    }

    bottomAir_to_heater
    {
        type            mappedWall;
        inGroups        2 ( wall viewFactorWall );
        nFaces          92;
        startFace       4810;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_bottomAir;
    }

)


// ************************************************************************* //
