chtMultiregionFoam/multiRegionHeaterRadiation/constant/bottomAir/visibleFaceFaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelListList;
    location    "constant/bottomAir";
    object      visibleFaceFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


120
(

91
(
6
7
8
9
12
13
14
15
16
17
18
19
20
21
23
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
66
67
68
69
70
71
72
74
75
79
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


92
(
6
7
8
12
13
14
15
16
17
18
19
20
21
23
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
66
67
68
69
70
71
72
79
80
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
117
118
119
)


90
(
6
7
11
12
13
14
15
16
17
18
19
20
21
22
23
25
26
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
76
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
107
109
116
117
118
119
)


91
(
6
10
11
12
13
14
15
16
17
18
19
20
21
22
23
25
26
27
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
70
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
107
109
116
117
118
119
)


93
(
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
26
27
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
107
109
111
112
113
114
115
116
117
118
119
)


90
(
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
26
27
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


88
(
0
1
2
3
12
15
17
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
97
98
99
100
101
102
103
104
105
106
108
110
117
118
119
)


91
(
0
1
2
12
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
96
97
98
99
100
101
102
103
104
105
106
108
110
116
117
118
119
)


89
(
0
1
5
12
14
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
95
96
97
98
99
100
101
108
110
116
117
118
119
)


90
(
0
4
5
12
14
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
92
93
94
95
96
97
98
99
100
101
108
110
116
117
118
119
)


95
(
3
4
5
13
14
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
83
84
85
92
93
94
95
96
97
98
99
100
101
108
110
111
112
113
114
115
116
117
118
119
)


89
(
2
3
4
5
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
84
89
90
92
93
94
95
96
97
98
99
101
108
110
111
112
113
114
115
116
117
118
119
)


82
(
0
1
2
3
4
5
6
7
8
9
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
66
67
68
69
70
71
72
75
79
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


79
(
0
1
2
3
4
5
10
11
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
107
109
116
117
118
119
)


79
(
0
1
2
3
4
5
8
9
10
11
30
31
32
33
34
35
36
37
38
39
40
41
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


79
(
0
1
2
3
4
5
6
7
8
9
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
66
67
68
69
70
71
72
74
75
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


77
(
0
1
2
3
4
5
10
11
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
107
109
116
117
118
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
66
67
68
69
70
71
72
74
75
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
118
)


69
(
0
1
2
3
4
5
10
11
30
31
32
33
34
35
36
37
38
39
40
41
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
116
117
118
119
)


78
(
0
1
2
3
4
5
7
8
9
10
11
21
30
31
32
33
34
35
36
37
38
39
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
69
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
107
109
111
112
113
114
115
116
117
118
119
)


78
(
0
1
2
3
4
5
6
7
8
9
10
11
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
63
64
65
66
67
68
69
70
71
72
73
74
75
77
78
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
)


83
(
0
1
2
3
4
5
6
7
8
9
10
11
19
24
29
30
31
32
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
86
87
88
89
90
91
92
93
94
95
96
97
111
112
113
114
115
116
117
118
119
)


74
(
2
3
4
5
6
7
8
9
10
11
24
29
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
89
90
92
93
94
95
96
97
99
108
110
111
112
113
114
115
116
117
118
119
)


75
(
0
1
2
3
4
5
6
7
8
9
10
11
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
98
99
100
101
102
103
104
105
106
108
110
)


75
(
6
7
8
9
10
11
21
22
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
83
84
85
96
97
98
99
100
101
108
110
116
117
118
119
)


77
(
0
1
2
3
6
7
8
9
10
11
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
98
99
100
101
102
103
104
105
106
108
110
117
118
119
)


77
(
2
3
4
5
6
7
8
9
10
11
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
89
90
92
93
94
95
96
97
98
99
101
108
110
111
112
113
114
115
116
117
118
119
)


81
(
3
4
5
6
7
8
9
10
11
29
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
84
92
93
94
95
96
97
98
99
100
101
108
110
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
6
7
8
9
10
11
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
98
99
100
101
102
103
104
105
106
108
110
117
118
119
)


82
(
0
1
6
7
8
9
10
11
21
22
27
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
95
96
97
98
99
100
101
108
110
116
117
118
119
)


77
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
21
23
24
25
28
29
48
49
50
51
52
53
54
55
56
57
58
59
66
67
68
69
70
71
72
74
75
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


77
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
21
23
24
25
28
29
48
49
50
51
52
53
54
55
56
57
58
59
66
67
68
69
70
71
72
74
75
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


77
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
21
23
24
25
28
29
48
49
50
51
52
53
54
55
56
57
58
59
66
67
68
69
70
71
72
74
75
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
23
24
25
27
28
29
48
49
50
51
52
53
54
55
56
57
66
67
68
69
70
71
72
74
75
78
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
23
24
25
27
28
29
48
49
50
51
52
53
54
55
56
57
66
67
68
69
70
71
72
74
75
78
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
116
118
119
)


79
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
27
28
29
48
49
50
51
52
53
54
55
56
57
65
66
67
68
69
70
71
72
73
74
75
77
78
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
118
)


79
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
27
28
29
48
49
50
51
52
53
54
55
56
57
65
66
67
68
69
70
71
72
73
74
75
77
78
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
118
)


81
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
26
27
28
29
48
49
50
51
52
53
54
55
56
57
63
64
65
66
67
68
69
70
71
72
73
74
75
77
78
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
109
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
26
27
28
29
48
49
50
51
52
53
54
55
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
77
78
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
26
27
28
29
48
49
50
51
52
53
54
55
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
77
78
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
20
21
22
23
24
25
26
27
28
29
48
49
50
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
93
95
96
98
99
100
101
102
103
104
105
106
108
110
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
20
21
22
23
24
25
26
27
28
29
48
49
50
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
93
95
96
98
99
100
101
102
103
104
105
106
108
110
)


75
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
93
95
98
99
100
101
102
103
104
105
106
108
110
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
93
98
99
100
101
102
103
104
105
106
108
110
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
93
98
99
100
101
102
103
104
105
106
108
110
119
)


77
(
0
1
2
3
4
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
98
99
100
101
102
103
104
105
106
108
110
117
118
119
)


77
(
0
1
2
3
4
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
92
98
99
100
101
102
103
104
105
106
108
110
117
118
119
)


77
(
0
1
2
3
4
6
7
8
9
10
11
12
13
15
17
20
21
22
23
24
25
26
27
28
29
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
98
99
100
101
102
103
104
105
106
108
110
117
118
119
)


76
(
0
1
2
3
4
5
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
40
41
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


76
(
0
1
2
3
4
5
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
40
41
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


77
(
0
1
2
3
4
5
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
40
41
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


76
(
0
1
2
3
4
5
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
69
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


76
(
0
1
2
3
4
5
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
69
72
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
107
109
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
28
29
30
31
32
33
34
35
36
37
38
39
47
68
69
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
107
109
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
28
29
30
31
32
33
34
35
36
37
38
39
47
68
69
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
107
109
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
21
22
24
26
27
28
29
30
31
32
33
34
35
36
37
38
39
45
46
47
68
69
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
107
109
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
21
22
24
25
26
27
28
29
30
31
32
33
34
35
36
37
43
44
45
46
47
67
68
69
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
21
22
24
25
26
27
28
29
30
31
32
33
34
35
36
37
43
44
45
46
47
67
68
69
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
18
19
21
22
23
24
25
26
27
28
29
30
31
32
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
86
87
88
89
90
91
92
93
94
95
96
97
108
110
111
112
113
114
115
116
117
118
119
)


80
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
18
19
21
22
23
24
25
26
27
28
29
30
31
32
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
86
87
88
89
90
91
92
93
94
95
96
97
108
110
111
112
113
114
115
116
117
118
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
16
18
19
21
22
23
24
25
26
27
28
29
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
86
87
88
89
90
91
92
93
94
95
96
97
99
108
110
111
112
113
114
115
116
117
118
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
16
18
19
21
22
23
24
25
26
27
28
29
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
86
87
89
90
91
92
93
94
95
96
97
99
108
110
111
112
113
114
115
116
117
118
119
)


76
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
16
18
19
21
22
23
24
25
26
27
28
29
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
86
87
89
90
91
92
93
94
95
96
97
99
108
110
111
112
113
114
115
116
117
118
119
)


76
(
1
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
86
89
90
92
93
94
95
96
97
98
99
101
108
110
111
112
113
114
115
116
117
118
119
)


76
(
1
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
86
89
90
92
93
94
95
96
97
98
99
101
108
110
111
112
113
114
115
116
117
118
119
)


76
(
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
35
36
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
89
90
92
93
94
95
96
97
98
99
101
108
110
111
112
113
114
115
116
117
118
119
)


61
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
58
59
60
61
62
63
64
65
102
103
104
105
106
108
110
85
)


61
(
0
1
2
3
4
6
7
8
9
10
11
12
13
15
16
17
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
56
57
58
59
60
61
62
63
64
65
102
103
104
105
106
108
110
)


62
(
0
1
2
3
6
7
8
9
10
11
12
13
15
17
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
53
54
55
56
57
58
59
60
61
62
63
64
65
102
103
104
105
106
108
110
)


67
(
0
1
2
6
7
8
9
10
11
12
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
72
102
103
104
105
106
108
110
68
78
81
)


61
(
0
1
2
3
6
7
8
9
10
11
12
15
17
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
58
59
60
61
62
63
64
65
76
79
85
100
102
103
104
105
106
108
110
119
)


60
(
0
1
2
6
7
8
9
10
11
12
15
17
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
53
54
55
56
57
58
59
60
61
62
63
64
65
102
103
104
105
106
108
110
)


63
(
0
1
6
7
8
9
10
11
12
14
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
69
75
108
110
)


44
(
6
7
8
9
10
11
20
21
22
23
24
25
26
27
28
29
35
36
37
38
39
40
41
42
43
44
45
46
47
53
54
55
56
57
58
59
60
61
62
63
64
65
108
110
)


61
(
0
5
6
7
8
9
10
11
14
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
108
110
85
)


63
(
0
4
5
6
7
8
9
10
11
12
14
15
17
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
72
108
110
)


58
(
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
21
22
23
24
25
26
27
28
29
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
70
108
110
111
112
113
114
115
)


62
(
3
4
5
6
7
8
9
10
11
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
108
110
111
112
113
114
115
)


64
(
3
4
5
6
7
8
9
10
11
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
108
110
111
112
113
114
115
)


62
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
16
18
19
21
22
23
24
25
26
27
28
29
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
70
91
108
110
111
112
113
114
115
)


60
(
1
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
21
22
23
24
25
26
27
28
29
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
108
110
111
112
113
114
115
)


63
(
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
20
21
22
23
24
25
26
27
28
29
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
108
110
111
112
113
114
115
)


62
(
0
1
2
3
4
5
6
7
8
9
12
13
14
15
16
17
18
19
20
21
23
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
102
103
104
105
106
107
109
)


64
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
21
23
24
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
87
102
103
104
105
106
107
109
)


62
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
102
103
104
105
106
107
109
)


68
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
19
20
23
24
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
70
91
102
103
104
105
106
107
109
118
66
98
99
100
101
)


66
(
0
1
2
3
4
5
6
7
8
12
13
14
15
16
17
18
19
20
21
23
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
102
103
104
105
106
107
109
82
)


64
(
0
1
2
3
4
5
6
7
8
12
13
14
15
16
17
18
19
20
21
23
25
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
83
102
103
104
105
106
107
109
)


54
(
0
1
2
3
4
5
6
7
12
13
14
15
16
17
18
19
20
21
23
25
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
107
109
)


61
(
0
1
2
3
4
5
6
11
12
13
14
15
16
17
18
19
20
21
22
23
25
26
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
)


61
(
0
1
2
3
4
5
6
11
12
13
14
15
16
17
18
19
20
21
22
23
25
26
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
)


45
(
0
1
2
3
4
5
12
13
14
15
16
17
18
19
20
21
30
31
32
33
34
35
36
37
38
39
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
79
85
107
109
)


65
(
0
1
2
3
4
5
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
26
27
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
111
112
113
114
115
)


62
(
0
1
2
3
4
5
9
10
11
12
13
14
15
16
17
18
19
20
21
22
26
27
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
111
112
113
114
115
)


57
(
0
1
2
3
4
5
9
10
11
12
13
14
15
16
17
18
19
20
21
22
26
27
30
31
32
33
34
35
36
37
38
39
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
111
112
113
114
115
)


62
(
0
1
2
3
4
5
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
26
27
29
30
31
32
33
34
35
36
37
38
39
40
41
42
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
111
112
113
114
115
)


63
(
0
1
2
3
4
5
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
40
41
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
111
112
113
114
115
)


62
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
24
26
27
29
30
31
32
33
34
35
36
37
38
39
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
107
109
111
112
113
114
115
)


61
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
63
64
65
102
103
104
105
106
)


62
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
20
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
60
61
62
63
64
65
102
103
104
105
106
)


54
(
0
1
2
3
4
5
6
7
8
9
10
12
13
14
15
16
17
18
20
23
24
25
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
70
102
103
104
105
106
)


50
(
0
1
2
3
4
6
7
8
9
10
11
12
13
15
16
17
20
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
63
64
65
102
103
104
105
106
)


45
(
0
1
6
7
12
15
17
20
23
25
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
82
83
84
85
86
87
98
99
100
101
)


45
(
0
1
6
7
12
15
17
20
23
25
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
82
83
84
85
86
87
98
99
100
101
)


45
(
0
1
6
7
12
15
17
20
23
25
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
82
83
84
85
86
87
98
99
100
101
)


45
(
0
1
6
7
12
15
17
20
23
25
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
82
83
84
85
86
87
98
99
100
101
)


45
(
0
1
6
7
12
15
17
20
23
25
28
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
66
67
68
69
70
71
82
83
84
85
86
87
98
99
100
101
)


46
(
0
1
2
3
4
5
12
13
14
15
16
17
18
19
30
31
32
33
34
35
36
37
48
49
50
51
52
53
54
55
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
)


46
(
6
7
8
9
10
11
22
23
24
25
26
27
28
29
40
41
42
43
44
45
46
47
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
)


46
(
0
1
2
3
4
5
12
13
14
15
16
17
18
19
30
31
32
33
34
35
36
37
48
49
50
51
52
53
54
55
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
)


46
(
6
7
8
9
10
11
22
23
24
25
26
27
28
29
40
41
42
43
44
45
46
47
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
)


44
(
4
5
10
11
14
19
21
22
26
27
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
76
77
78
79
80
81
92
93
94
95
96
97
116
117
118
119
)


44
(
4
5
10
11
14
19
21
22
26
27
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
76
77
78
79
80
81
92
93
94
95
96
97
116
117
118
119
)


44
(
4
5
10
11
14
19
21
22
26
27
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
76
77
78
79
80
81
92
93
94
95
96
97
116
117
118
119
)


44
(
4
5
10
11
14
19
21
22
26
27
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
76
77
78
79
80
81
92
93
94
95
96
97
116
117
118
119
)


44
(
4
5
10
11
14
19
21
22
26
27
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
76
77
78
79
80
81
92
93
94
95
96
97
116
117
118
119
)


52
(
0
1
2
3
4
5
7
8
9
10
11
12
13
14
15
16
18
19
21
22
24
26
27
29
30
31
32
33
34
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
111
112
113
114
115
)


50
(
1
2
3
4
5
6
7
8
9
10
11
13
14
16
18
19
21
22
24
25
26
27
28
29
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
111
112
113
114
115
)


62
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
21
22
24
25
26
27
28
29
30
31
32
33
34
35
36
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
85
111
112
113
114
115
)


62
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
18
19
21
22
24
25
26
27
28
29
30
31
32
33
34
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
70
111
112
113
114
115
)

)


// ************************************************************************* //
